In [2]:
import pandas as pd

data = {
    'Name': ['Asha', 'Ravi', 'Neha', 'Kiran', 'Sita'],
    'Age': [23, 25, 22, None, 24],
    'Marks': [85, 90, None, 70, 88],
    'City': ['Bangalore', 'Mumbai', 'Delhi', 'Delhi', None]
}

df = pd.DataFrame(data)
print(df)

    Name   Age  Marks       City
0   Asha  23.0   85.0  Bangalore
1   Ravi  25.0   90.0     Mumbai
2   Neha  22.0    NaN      Delhi
3  Kiran   NaN   70.0      Delhi
4   Sita  24.0   88.0       None

In [4]:
#DataFrame understanding
df.shape

(5, 4)

In [5]:
df.columns

Index(['Name', 'Age', 'Marks', 'City'], dtype='object')

In [7]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
df.dtypes

Name      object
Age      float64
Marks    float64
City      object
dtype: object

In [10]:
df.info

<bound method DataFrame.info of     Name   Age  Marks       City
0   Asha  23.0   85.0  Bangalore
1   Ravi  25.0   90.0     Mumbai
2   Neha  22.0    NaN      Delhi
3  Kiran   NaN   70.0      Delhi
4   Sita  24.0   88.0       None>

In [11]:
df.describe

<bound method NDFrame.describe of     Name   Age  Marks       City
0   Asha  23.0   85.0  Bangalore
1   Ravi  25.0   90.0     Mumbai
2   Neha  22.0    NaN      Delhi
3  Kiran   NaN   70.0      Delhi
4   Sita  24.0   88.0       None>

In [24]:
#step3 INDEXING & SELECTION

In [16]:
#column selection
df['Name']

0     Asha
1     Ravi
2     Neha
3    Kiran
4     Sita
Name: Name, dtype: object

In [17]:
df[['Name', 'Marks']]

    Name  Marks
0   Asha   85.0
1   Ravi   90.0
2   Neha    NaN
3  Kiran   70.0
4   Sita   88.0

In [18]:
# row selection
df.loc[0]

Name          Asha
Age           23.0
Marks         85.0
City     Bangalore
Name: 0, dtype: object

In [19]:
df.loc[1:3] # loc will include the number in range

    Name   Age  Marks    City
1   Ravi  25.0   90.0  Mumbai
2   Neha  22.0    NaN   Delhi
3  Kiran   NaN   70.0   Delhi

In [22]:
df.iloc[-1]

Name     Sita
Age      24.0
Marks    88.0
City     None
Name: 4, dtype: object

In [23]:
df.iloc[1:4] # iloc will not include the last number it will provide the data till last but one in range

    Name   Age  Marks    City
1   Ravi  25.0   90.0  Mumbai
2   Neha  22.0    NaN   Delhi
3  Kiran   NaN   70.0   Delhi

In [25]:
# 1 column selection and row selection
df.loc[0:2, ('Name','City')]

   Name       City
0  Asha  Bangalore
1  Ravi     Mumbai
2  Neha      Delhi

In [26]:
df.iloc[2, 1]

np.float64(22.0)

In [27]:
df.iloc[:, 2]

0    85.0
1    90.0
2     NaN
3    70.0
4    88.0
Name: Marks, dtype: float64

In [ ]:
#Step 4: ADDING & MODIFYING DATA

In [12]:
#Add a new column
df['percentage'] = df['Marks']/ 100
print(df)

    Name   Age  Marks       City  rank  rank_m  percentage
0   Asha  23.0   85.0  Bangalore   3.0     3.0        0.85
1   Ravi  25.0   90.0     Mumbai   1.0     1.0        0.90
2   Neha  22.0    NaN      Delhi   NaN     NaN         NaN
3  Kiran   NaN   70.0      Delhi   4.0     4.0        0.70
4   Sita  24.0   88.0       None   2.0     2.0        0.88

In [13]:
df['Passed'] = df['Marks'] >= 75
print(df)

    Name   Age  Marks       City  rank  rank_m  percentage  Passed
0   Asha  23.0   85.0  Bangalore   3.0     3.0        0.85    True
1   Ravi  25.0   90.0     Mumbai   1.0     1.0        0.90    True
2   Neha  22.0    NaN      Delhi   NaN     NaN         NaN   False
3  Kiran   NaN   70.0      Delhi   4.0     4.0        0.70   False
4   Sita  24.0   88.0       None   2.0     2.0        0.88    True

In [35]:
#Add a new row
df.loc[5]=['chaithra',22,95,'kundapura',0.95,True]
print(df)

       Name   Age  Marks       City  percentage  Passed
0      Asha  23.0   85.0  Bangalore        0.85    True
1      Ravi  25.0   90.0     Mumbai        0.90    True
2      Neha  22.0    NaN      Delhi         NaN   False
3     Kiran   NaN   70.0      Delhi        0.70   False
4      Sita  24.0   88.0       None        0.88    True
5  chaithra  22.0   95.0  kundapura        0.95    True

In [38]:
df.loc[len(df)] = ['Manoj', 26, 92, 'Chennai', 0.92,True]
print(df)

       Name   Age  Marks       City  percentage  Passed
0      Asha  23.0   85.0  Bangalore        0.85    True
1      Ravi  25.0   90.0     Mumbai        0.90    True
2      Neha  22.0    NaN      Delhi         NaN   False
3     Kiran   NaN   70.0      Delhi        0.70   False
4      Sita  24.0   88.0       None        0.88    True
5  chaithra  22.0   95.0  kundapura        0.95    True
6     Manoj  26.0   92.0    Chennai        0.92    True
7     Manoj  26.0   92.0    Chennai        0.92    True

In [ ]:
#Step 5: CONDITIONAL SUBSETTING

In [42]:
#Simple conditions
df['Marks']>=75

0     True
1     True
2    False
3    False
4     True
5     True
6     True
7     True
Name: Marks, dtype: bool

In [55]:
df[ df ['City']=='Delhi']

    Name   Age  Marks   City  percentage  Passed
2   Neha  22.0    NaN  Delhi         NaN   False
3  Kiran   NaN   70.0  Delhi         0.7   False

In [57]:
#Multiple conditions
df[(df ['City']=='Delhi')& (df ['Marks']>=75)]

Empty DataFrame
Columns: [Name, Age, Marks, City, percentage, Passed]
Index: []

In [58]:
df[(df ['Marks']>80 ) & (df['City']=='Bangalore')]

   Name   Age  Marks       City  percentage  Passed
0  Asha  23.0   85.0  Bangalore        0.85    True

In [59]:
df[df['City'].isin(['Delhi', 'Mumbai'])]

    Name   Age  Marks    City  percentage  Passed
1   Ravi  25.0   90.0  Mumbai         0.9    True
2   Neha  22.0    NaN   Delhi         NaN   False
3  Kiran   NaN   70.0   Delhi         0.7   False

In [62]:
df[df['City'].isin(['udupi', 'Mumbai'])]

   Name   Age  Marks    City  percentage  Passed
1  Ravi  25.0   90.0  Mumbai         0.9    True

In [ ]:
#Step 6: MISSING VALUES

In [63]:
#Check missing values
df.isnull()

    Name    Age  Marks   City  percentage  Passed
0  False  False  False  False       False   False
1  False  False  False  False       False   False
2  False  False   True  False        True   False
3  False   True  False  False       False   False
4  False  False  False   True       False   False
5  False  False  False  False       False   False
6  False  False  False  False       False   False
7  False  False  False  False       False   False

In [65]:
#sum /count of missing value
df.isnull().sum()

Name          0
Age           1
Marks         1
City          1
percentage    1
Passed        0
dtype: int64

In [ ]:
#Fill missing values

In [83]:
df['Age'] = pd.to_numeric(df['Age'], errors='coerce') # here age is converted to numeric because by default some str value was there 
                                                     #in that so we cant

In [86]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [87]:
df['Marks'] = df['Marks'].fillna(df['Marks'].median())

In [88]:
df['City'] = df['City'].fillna('Unknown')

In [89]:
# Drop missing values
df.dropna()

       Name   Age  Marks       City percentage  Passed
0      Asha  23.0   85.0  Bangalore       0.85    True
1      Ravi  25.0   90.0     Mumbai        0.9    True
2      Neha  22.0   90.0      Delhi    unknown   False
3     Kiran  24.0   70.0      Delhi        0.7   False
4      Sita  24.0   88.0    unknown       0.88    True
5  chaithra  22.0   95.0  kundapura       0.95    True
6     Manoj  26.0   92.0    Chennai       0.92    True
7     Manoj  26.0   92.0    Chennai       0.92    True

In [90]:
#Step 7: SORTING & RANKING
#sorting
df.sort_values(by='Marks' , ascending=False)

       Name   Age  Marks       City percentage  Passed
5  chaithra  22.0   95.0  kundapura       0.95    True
6     Manoj  26.0   92.0    Chennai       0.92    True
7     Manoj  26.0   92.0    Chennai       0.92    True
1      Ravi  25.0   90.0     Mumbai        0.9    True
2      Neha  22.0   90.0      Delhi    unknown   False
4      Sita  24.0   88.0    unknown       0.88    True
0      Asha  23.0   85.0  Bangalore       0.85    True
3     Kiran  24.0   70.0      Delhi        0.7   False

In [10]:
#ranking
#Rank
df["rank_m"]=df['Marks'].rank(ascending=False)

In [9]:
#dense rank
df['rank']=df['Marks'].rank(method='dense',ascending=False)
print(df)

    Name   Age  Marks       City  rank
0   Asha  23.0   85.0  Bangalore   3.0
1   Ravi  25.0   90.0     Mumbai   1.0
2   Neha  22.0    NaN      Delhi   NaN
3  Kiran   NaN   70.0      Delhi   4.0
4   Sita  24.0   88.0       None   2.0

#Step 8: SMALL CHALLENGE QUESTIONS (Practice Test)
Get names of students whose marks are above average

Count how many students are from each city

Find the student with highest marks

Replace marks < 75 with "Fail"

Select only Name and Rank columns

Sort students by Age and Marks together

In [98]:
#Get names of students whose marks are above average
df['Name']

0        Asha
1        Ravi
2        Neha
3       Kiran
4        Sita
5    chaithra
6       Manoj
7       Manoj
Name: Name, dtype: object

In [99]:
df['Marks']

0    85.0
1    90.0
2    90.0
3    70.0
4    88.0
5    95.0
6    92.0
7    92.0
Name: Marks, dtype: float64

In [100]:
df['Marks'].mean()

np.float64(87.75)

In [120]:
df.loc[df['Marks'] > df['Marks'].mean(), 'Name']

1        Ravi
2        Neha
4        Sita
5    chaithra
6       Manoj
7       Manoj
Name: Name, dtype: object

In [121]:
df.loc[df['Marks'] > df['Marks'].mean()]

       Name   Age  Marks       City percentage  Passed  rank_m  rank
1      Ravi  25.0   90.0     Mumbai        0.9    True     4.5   3.0
2      Neha  22.0   90.0      Delhi    unknown   False     4.5   3.0
4      Sita  24.0   88.0    unknown       0.88    True     6.0   4.0
5  chaithra  22.0   95.0  kundapura       0.95    True     1.0   1.0
6     Manoj  26.0   92.0    Chennai       0.92    True     2.5   2.0
7     Manoj  26.0   92.0    Chennai       0.92    True     2.5   2.0

In [ ]:
#Count how many students are from each city

In [127]:
df['City'].value_counts()

City
Chennai      2
Delhi        2
Mumbai       1
Bangalore    1
unknown      1
kundapura    1
Name: count, dtype: int64

In [134]:
#Sort students by City, then by Marks (descending)
df.sort_values(by=['City','Marks'] , ascending=[True,False])

       Name   Age  Marks       City percentage  Passed  rank_m  rank
0      Asha  23.0   85.0  Bangalore       0.85    True     7.0   5.0
6     Manoj  26.0   92.0    Chennai       0.92    True     2.5   2.0
7     Manoj  26.0   92.0    Chennai       0.92    True     2.5   2.0
2      Neha  22.0   90.0      Delhi    unknown   False     4.5   3.0
3     Kiran  24.0   70.0      Delhi        0.7   False     8.0   6.0
1      Ravi  25.0   90.0     Mumbai        0.9    True     4.5   3.0
5  chaithra  22.0   95.0  kundapura       0.95    True     1.0   1.0
4      Sita  24.0   88.0    unknown       0.88    True     6.0   4.0

In [136]:
#check duplicate
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [158]:
#delete duplicate
df = df.drop_duplicates()
print(df)

       Name   Age  Marks       City percentage  Passed  rank_m  rank Result
0      Asha  23.0   85.0  Bangalore       0.85    True     7.0   5.0   Pass
1      Ravi  25.0   90.0     Mumbai        0.9    True     4.5   3.0   Pass
2      Neha  22.0   90.0      Delhi    unknown   False     4.5   3.0   Pass
3     Kiran  24.0    NaN      Delhi        0.7   False     8.0   6.0   Fail
4      Sita  24.0   88.0    unknown       0.88    True     6.0   4.0   Pass
5  chaithra  22.0   95.0  kundapura       0.95    True     1.0   1.0   Pass
6     Manoj  26.0   92.0    Chennai       0.92    True     2.5   2.0   Pass

In [144]:
#Find the student with highest marks
df[df ['Marks']==df ['Marks'].max()]

       Name   Age  Marks       City percentage  Passed  rank_m  rank
5  chaithra  22.0   95.0  kundapura       0.95    True     1.0   1.0

In [146]:
df.loc[df['Marks'] == df['Marks'].max(), 'Name']

5    chaithra
Name: Name, dtype: object

In [34]:
#Replace marks < 75 with "Fail"
df['Result'] = 'Pass'
df.loc[df['Marks'] < 75, 'Result'] = 'Fail'

In [152]:
# this is used fix the numeric column whether that contains any string value in it
df['Marks'] = pd.to_numeric(df['Marks'], errors='coerce')

In [156]:
df['Result'] = 'Pass'
df.loc[(df['Marks'] < 75) | (df['Marks'].isna()), 'Result'] = 'Fail'

In [157]:
print(df)

       Name   Age  Marks       City percentage  Passed  rank_m  rank Result
0      Asha  23.0   85.0  Bangalore       0.85    True     7.0   5.0   Pass
1      Ravi  25.0   90.0     Mumbai        0.9    True     4.5   3.0   Pass
2      Neha  22.0   90.0      Delhi    unknown   False     4.5   3.0   Pass
3     Kiran  24.0    NaN      Delhi        0.7   False     8.0   6.0   Fail
4      Sita  24.0   88.0    unknown       0.88    True     6.0   4.0   Pass
5  chaithra  22.0   95.0  kundapura       0.95    True     1.0   1.0   Pass
6     Manoj  26.0   92.0    Chennai       0.92    True     2.5   2.0   Pass

In [163]:
#Select only Name and Rank columns
df[['Name','rank']]

       Name  rank
0      Asha   5.0
1      Ravi   3.0
2      Neha   3.0
3     Kiran   6.0
4      Sita   4.0
5  chaithra   1.0
6     Manoj   2.0

In [168]:
#Sort students by Age and Marks together
df.sort_values(by=['Age','Marks'], ascending=False)

       Name   Age  Marks       City percentage  Passed  rank_m  rank Result
6     Manoj  26.0   92.0    Chennai       0.92    True     2.5   2.0   Pass
1      Ravi  25.0   90.0     Mumbai        0.9    True     4.5   3.0   Pass
4      Sita  24.0   88.0    unknown       0.88    True     6.0   4.0   Pass
3     Kiran  24.0    NaN      Delhi        0.7   False     8.0   6.0   Fail
0      Asha  23.0   85.0  Bangalore       0.85    True     7.0   5.0   Pass
5  chaithra  22.0   95.0  kundapura       0.95    True     1.0   1.0   Pass
2      Neha  22.0   90.0      Delhi    unknown   False     4.5   3.0   Pass

In [17]:
df.head()

    Name   Age  Marks       City  rank  rank_m  percentage  Passed Result
0   Asha  23.0   85.0  Bangalore   3.0     3.0        0.85    True   Pass
1   Ravi  25.0   90.0     Mumbai   1.0     1.0        0.90    True   Pass
2   Neha  22.0    NaN      Delhi   NaN     NaN         NaN   False   Pass
3  Kiran   NaN   70.0      Delhi   4.0     4.0        0.70   False   Fail
4   Sita  24.0   88.0       None   2.0     2.0        0.88    True   Pass

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         4 non-null      float64
 2   Marks       4 non-null      float64
 3   City        4 non-null      object
 4   rank        4 non-null      float64
 5   rank_m      4 non-null      float64
 6   percentage  4 non-null      float64
 7   Passed      5 non-null      bool
 8   Result      5 non-null      object
dtypes: bool(1), float64(5), object(3)
memory usage: 457.0+ bytes

In [18]:
df[['Name' ,'rank']]

    Name  rank
0   Asha   3.0
1   Ravi   1.0
2   Neha   NaN
3  Kiran   4.0
4   Sita   2.0

In [20]:
df.loc[df['Result'] =='Pass','Name']

0    Asha
1    Ravi
2    Neha
4    Sita
Name: Name, dtype: object

In [22]:
df['City'].value_counts()

City
Delhi        2
Bangalore    1
Mumbai       1
Name: count, dtype: int64

In [23]:
df['Marks']=pd.to_numeric(df['Marks'],errors='coerce')

In [25]:
df.loc[df['Marks']>75,['Name','Marks']]

   Name  Marks
0  Asha   85.0
1  Ravi   90.0
4  Sita   88.0

In [27]:
#Get the names of students whose marks are ABOVE the average marks.
df.loc[df['Marks']> df['Marks'].mean() , ['Name','Marks']]

   Name  Marks
0  Asha   85.0
1  Ravi   90.0
4  Sita   88.0

In [31]:
#Count how many students are from each city.
df['City'].value_counts()

City
Delhi        2
Bangalore    1
Mumbai       1
Name: count, dtype: int64

In [39]:
df['Result']="pass"
df.loc[(df['Marks']<75)|(df ['Marks'].isna()),'Result']='Fail'
print(df)

    Name   Age  Marks       City  rank  rank_m  percentage  Passed Result
0   Asha  23.0   85.0  Bangalore   3.0     3.0        0.85    True   pass
1   Ravi  25.0   90.0     Mumbai   1.0     1.0        0.90    True   pass
2   Neha  22.0    NaN      Delhi   NaN     NaN         NaN   False   Fail
3  Kiran   NaN   70.0      Delhi   4.0     4.0        0.70   False   Fail
4   Sita  24.0   88.0       None   2.0     2.0        0.88    True   pass

In [41]:
df.sort_values(by='Marks' ,ascending=False).head(3)

   Name   Age  Marks       City  rank  rank_m  percentage  Passed Result
1  Ravi  25.0   90.0     Mumbai   1.0     1.0        0.90    True   pass
4  Sita  24.0   88.0       None   2.0     2.0        0.88    True   pass
0  Asha  23.0   85.0  Bangalore   3.0     3.0        0.85    True   pass

In [43]:
df.loc[df['City']=='Delhi' ,['Name','City']]

    Name   City
2   Neha  Delhi
3  Kiran  Delhi